#+title:  ob-fsharp
#+author: Ellis Kenyő
#+date: 2022-04-06
#+latex_class: chameleon

** Return types
Array/list types should return their results as a table where applicable

#+begin_example
#+begin_src fsharp
[1; 2; 3]
#+end_src

#+RESULTS:
| 1 | 2 | 3 |
#+end_example

/Unless/ told otherwise

#+begin_example
#+begin_src fsharp :results raw
[1; 2; 3]
#+end_src

#+RESULTS:
val it: int list = [1; 2; 3]
#+end_example

** Sessions
The exporter also handles sessions, if you wanted to have multiple blocks run in an isolated environment.

Copy the following examples, and try executing the bottom one first.

#+begin_example
#+begin_src fsharp :session ob-fsharp
let adder a = a + 5
#+end_src

#+begin_src fsharp :session ob-fsharp
adder 5
#+end_src

#+RESULTS:
: adder 5;;
:   ^^^^^
:
: /private/tmp/stdin(1,1): error FS0039: The value or constructor 'adder' is not defined.
#+end_example

As expected, you can't use a function before it's defined. Running both in sequence should produce the following:

#+begin_example
#+begin_src fsharp :session ob-fsharp
let adder a = a + 5
#+end_src

#+RESULTS:
: val adder: a: int -> int

#+begin_src fsharp :session ob-fsharp
adder 5
#+end_src

#+RESULTS:
: 10
#+end_example

